let initialState = {
    news: [
        {
            id: 1,
            title: "Коллектив старейшего в мире оркестра дважды выступит в Сириусе",
            preview: "Музыкальный фестиваль «Сочи.Сириус» продолжат выступления старейшего в мире оркестра, история которого насчитывает более четырехсот лет.",
            text: "27 и 28 августа пройдут концерты Дрезденского камерного оркестра Саксонской государственной капеллы. Коллектив представит две программы:\n" +
                "\n" +
                "В первый вечер прозвучат «Времена года» сразу двух композиторов – итальянского автора эпохи барокко Антонио Вивальди и аргентинского композитора XX века Астора Пьяццоллы.\n" +
                "\n" +
                "Во второй вечер оркестр исполнит шедевры И. С. Баха, В. А. Моцарта, Ф. Мендельсона, Р. Штрауса, Д. Шостаковича, написанные специально для камерного оркестра.\n" +
                "\n" +
                "В открытии музыкального вечера примет участие Чрезвычайный и Полномочный Посол Федеративной Республики Германия в Российской Федерации Геза Андреас фон Гайр.\n" +
                "Начало концертов в 19:30.",
            img: "https://drivenew.ru/upload/resize_cache/iblock/5ea/944_629_26b22810fab4bff8ee101c821c0453bc5/5ea4380f1a655a89b74479f44c6d43fe.jpg",
        },
        {
            id: 2,
            title: "Титан российской классической сцены выступит в Сириусе",
            preview: "В Парке науки и искусства продолжается Музыкальный фестиваль «Сочи.Сириус», который проходит при поддержке Министерства культуры Российской Федерации.\n",
            text: "В ближайший уик-энд состоятся концерты одного из самых мощных и активно развивающихся коллективов России – Государственного симфонического оркестра Республики Татарстан.\n" +
                "\n" +
                "21 августа коллектив выступит под управлением художественного руководителя и главного дирижера Александра Сладковского и исполнит шедевры классической музыки, среди которых «Половецкие пляски» из оперы Александра Бородина «Князь Игорь», Вторая симфония Сергея Рахманинова, «Вакханалия» из оперы Камиля Сен-Санса «Самсон и Далила».\n" +
                "\n" +
                "22 августа солистом концерта выступит знаменитый виолончелист Сергей Ролдугин. Вместе с Государственным симфоническим оркестром Республики Татарстан народный артист России исполнит Первый концерт для виолончели с оркестром К. Сен-Санса. В заключение вечера прозвучит лаконичная и стремительная Пятая симфония Людвига ван Бетховена.\n" +
                "\n" +
                "Начало концерта 21 августа в 19:30, 22 августа в 18:00.",
            img: "https://drivenew.ru/upload/resize_cache/iblock/6b7/944_629_26b22810fab4bff8ee101c821c0453bc5/6b7a57199776d9934867ffb96199e9c9.jpg",
        },
        {
            id: 3,
            title: "Праздник венской музыки: в Сириусе выступит Венский фестивальный оркестр Иоганна Штрауса",
            preview: "7 и 8 августа в Парке науки и искусства «Сириус» выступит Венский фестивальный оркестр Иоганна Штрауса.",
            text: "Коллектив известен во всем мире как главный популяризатор и хранитель музыкальной венской культуры. Репертуар оркестра объединяет произведения австрийских композиторов – авторов жизнерадостных полек, чарующих вальсов, торжественных маршей. Особое место в нем занимают сочинения династии Штраусов.\n" +
                "\n" +
                "Во главе оркестра с момента его образования в 1978 году стоит всемирно признанный эксперт по творчеству семейства Штраусов Питер Гут. Маэстро выступает в качестве дирижера и солиста оркестра одновременно, дирижируя со скрипкой в руках.\n" +
                "Начало концерта 7 августа в 19:30, 8 августа в 18:00.",
            img: "https://drivenew.ru/upload/resize_cache/iblock/9f5/944_629_16b22810fab4bff8ee101c821c0453bc5/9f55d1710ecc1743f5d7ef45a8fd20a6.jpg",
        },
    ]
};

const newsReducer = (state = initialState, action) => {
    return state;
}

export default newsReducer;